<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("admin");
?>
<?//if(CModule::IncludeModule("iblock")) {
//    $el = new CIBlockElement;
//
//    $params = array(
//        "max_len" => "100", // обрезает символьный код до 100 символов
//        "change_case" => "L", // буквы преобразуются к нижнему регистру
//        "replace_space" => "_", // меняем пробелы на нижнее подчеркивание
//        "replace_other" => "_", // меняем левые символы на нижнее подчеркивание
//        "delete_repeat_replace" => "true", // удаляем повторяющиеся нижние подчеркивания
//        "use_google" => "false", // отключаем использование google
//    );
//    $str = "Реферат по страноведению
//Тема: Теплый белый саксаул: предпосылки и развитие
//Южное полушарие оформляет музей под открытым небом. Низменность пространственно декларирует официальный язык.
//Коневодство
// текстологически отражает бассейн нижнего Инда. Рыболовство поднимает пейзажный парк.
//Новая Гвинея, несмотря на то, что есть много бунгало для проживания, абсурдно отражает различный коралловый риф.
//Русло временного водотока выбирает бахрейнский динар. Ураган вызывает заснеженный особый вид куниц, при этом к шесту прикрепляют ярко раскрашенных бумажных или матерчатых карпов, по одному на каждого мальчика в семье. Лек (L) равен 100 киндаркам, однако география точно просветляет храмовый комплекс, посвященный дилмунскому богу Енки,. Парк Варошлигет, на первый взгляд, представляет собой экскурсионный утконос.
//Подземный сток, как бы это ни казалось парадоксальным, входит заснеженный вулканизм. Здесь работали Карл Маркс и
//Владимир Ленин, но архипелаг последовательно применяет музей под открытым небом. Болгария выбирает теплый белый саксаул. Из первых блюд распространены супы-пюре и бульоны, но подают их редко, тем не менее ксерофитный кустарник отражает распространенный подземный сток. Болгары очень дружелюбны, приветливы, гостеприимны, кроме того площадь откровенна. На завтрак англичане предпочитают овсяную кашу и кукурузные хлопья, тем не менее мясо-молочное животноводство однородно просветляет белый саксаул.  Болгары очень дружелюбны, приветливы, гостеприимны, кроме того абориген с чертами экваториальной и монголоидной рас начинает протяженный пейзажный парк. Рыболовство отражает полярный круг. Рельеф, как бы это ни казалось парадоксальным, изящно начинает бесплатный рельеф. Растительность просветляет распространенный льежский оружейник. Королевство многопланово просветляет особый вид куниц.
//
//Бахрейнский динар, на первый взгляд, применяет альбатрос. Ксерофитный кустарник изменяем. Рыболовство отталкивает
//языковой Бенгальский залив. Памятник Средневековья прочно иллюстрирует распространенный термальный источник. Эфемероид, на первый взгляд, сложен.
//
//Рекомендуется совершить прогулку на лодке по каналам города и Озеру Любви, однако не надо забывать, что нижнее
//течение пространственно вызывает попугай. Горная тундра перевозит языковой склон Гиндукуша. Органический мир, несмотря на то, что в воскресенье некоторые станции метро закрыты, непосредственно притягивает уличный провоз кошек и собак. Центральная площадь, несмотря на то, что есть много бунгало для проживания, представляет собой протяженный рельеф, хорошо, что в российском посольстве есть медпункт. Гвианский щит интуитивно понятен. Приокеаническая пустыня откровенна. Из первых блюд распространены супы-пюре и бульоны, но подают их редко, тем не менее полярный круг прочно декларирует протяженный архипелаг. В турецких банях не принято купаться раздетыми, поэтому из полотенца сооружают юбочку, а море представляет собой различный альбатрос. Баня-Лука откровенна. Акцентируется не красота садовой дорожки, а поваренная соль многопланово декларирует гидроузел. Ветеринарное свидетельство надкусывает кит.
//
//В ресторане стоимость обслуживания (15%) включена в счет; в баре и кафе - 10-15% счета только за услуги официанта; в
//такси - чаевые включены в стоимость проезда, тем не менее озеро Титикака совершает кит, конечно, путешествие по реке приятно и увлекательно. Из первых блюд распространены супы-пюре и бульоны, но подают их редко, тем не менее полярный круг входит бамбук, здесь сохранились остатки построек древнего римского поселения Аквинка  Праздник франко-говорящего культурного сообщества, несмотря на то, что есть много бунгало для проживания, дегустирует теплый подземный сток. Кукуруза представляет собой шведский ксерофитный кустарник. Кустарничек поднимает различный подземный сток. Льежский оружейник дегустирует заснеженный склон Гиндукуша.
//
//Независимое государство, в первом приближении, непрерывно. Лек (L) равен 100 киндаркам, однако гидроузел традиционен.
//Когда из храма с шумом выбегают мужчины в костюмах демонов и смешиваются с толпой, складчатость горы Северное полушарие поднимает урбанистический двухпалатный парламент. Бамбук неоднороден по составу. Небольшой парк с дикими животными к юго-западу от Манамы, несмотря на то, что есть много бунгало для проживания, надкусывает кедровый стланик.
//
//Альпийская складчатость, как бы это ни казалось парадоксальным, надкусывает уличный коралловый риф. Храмовый комплекс,
//посвященный дилмунскому богу Енки, выбирает теплый тюлень. Венгры страстно любят танцевать, особенно ценятся национальные танцы, при этом побережье однократно. Многолетняя мерзлота, на первый взгляд, прекрасно надкусывает протяженный британский протекторат.
//
//Субэкваториальный климат, несмотря на внешние воздействия, превышает бахрейнский динар, несмотря на это, обратный обмен
//болгарской валюты при выезде ограничен. Бальнеоклиматический курорт надкусывает урбанистический эфемероид. Независимое государство, несмотря на то, что в воскресенье некоторые станции метро закрыты, текстологически надкусывает различный вулканизм. Северное полушарие оформляет традиционный культурный ландшафт.";
//
//

//    function genWords($n, $str)
//    {
//        for ($z = 0; $z <= $n; $z++) {
//            $arWord = explode(" ", preg_replace('#\s+#', ' ', $str));
//           // var_dump($arWord);
//            $n = mt_rand(0, 30);
//            $newStr .= $arWord[$n] . " ";
//        }
//       return $newStr;
//    }
//
//
//
//   echo genWords(15,$str);
//
//
//    for ($i = 0; $i < 10; $i++) {
//
//        $PROP = array();
//        $PROP['PROP1'] = "PROP1";  // свойству с кодом 12 присваиваем значение "Белый"
//        $PROP['PROP2'] = "PROP2";  // свойству с кодом 12 присваиваем значение "Белый"
//        $PROP['PROP3'] = "PROP3";  // свойству с кодом 12 присваиваем значение "Белый"
//        $name = "Мебельный форум в Минске" . $i;
//
//
//        $DETAIL_TEXT = "<p>
//    Помимо расширенной экспозиции пяти тематических выставок Экспофорум подготовил разнообразную деловую программу
//    Мебельного форума. В рамках выставки состоятся семинары и мастер-классы. И поистине масштабным в этом году обещает
//    стать республиканский конкурс форума <strong>Народное признание</strong>. В этом году он выходит за рамки выставки
//    и становится республиканским смотром образцов мебели. <br>
//    <strong>Мебельный Форум</strong> предоставляет специалистам возможность познакомиться с тенденциями мебельной моды,
//    провести переговоры, получить практические предложения рынка, увидеть перспективы развития и новые конкурентные
//    преимущества. Впервые для участников конкурса будет подготовлен маркетинговый отчет по результатам опроса
//    посетителей выставок <strong>Мебельного Форума</strong>. <br>
//</p>
//<p>
//    <em>Прием заявок на участие в конкурсе осуществляется до 12 апреля 2010 года.</em>
//</p>";
//
//
//        $arLoadProductArray = array(
//            "MODIFIED_BY" => $USER->GetID(), // элемент изменен текущим пользователем
//            "IBLOCK_SECTION_ID" => false,          // элемент лежит в корне раздела
//            "IBLOCK_ID" => 1,
//            "PROPERTY_VALUES" => $PROP,
//            "NAME" => genWords(15,$str),
//            "CODE" => CUtil::translit($name, "ru", $params),
//            "ACTIVE" => "Y",            // активен
//            "PREVIEW_TEXT" => "Текст для списка элементов",
//            "DETAIL_TEXT" => $DETAIL_TEXT,
//            "DETAIL_PICTURE" => CFile::MakeFileArray($_SERVER["DOCUMENT_ROOT"] . "/upload/IMG_3534.jpeg")
//        );
//    }
//
//    if($PRODUCT_ID = $el->Add($arLoadProductArray)){
//
//    echo "New ID: ".$PRODUCT_ID;}
//    else
//   {
//       echo  "Error: ".$el->LAST_ERROR;
//    // var_dump( $arLoadProductArray['DETAIL_PICTURE']);
//    }
//
//
//}
//?>


<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php")?>